{
  "header_summary": "Antoine Riard, a Bitcoin Core contributor, expressed support for incorporating covenant schemes into Bitcoin, highlighting their potential to simplify Lightning Network proposals. He provided an update on the Bitcoin Contracting Primitives Working Group but stated that he would be stepping back from actively maintaining it due to his focus on Lightning development. Antoine emphasized the importance of robust testing and collaboration in the Bitcoin development community, while also mentioning potential opportunities for those interested in contributing to consensus changes.",
  "enteries": [
      {
          "id": "021789",
          "title": "On the experiment of the Bitcoin Contracting Primitives WG and marking this community process \"up for grabs\"",
          "link": "https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2023-July/021789.html",
          "authors": [
              "Greg Sanders"
          ],
          "published_at": "2023-07-20T06:11:57+00:00",
          "summary": "- Antoine Riard supports incorporating covenant schemes into Bitcoin as they can simplify complex Lightning Network proposals and contribute to LN's maturity.- Antoine plans to prioritize the scalability and reliability of the Lightning Network over actively pursuing the process maintenance of the Bitcoin Contracting Primitives Working Group.- Antoine encourages better testing of consensus change proposals, collaboration in the Bitcoin development community, and the preservation of consensus changes proposals for Bitcoin's advancement.",
          "n_threads": 6,
          "dev_name": "bitcoin-dev",
          "contributors": [
              "Antoine Riard",
              "Keagan McClelland"
          ]
      },
      {
          "id": "021791",
          "title": "On the experiment of the Bitcoin Contracting Primitives WG and marking this community process \"up for grabs\"",
          "link": "https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2023-July/021791.html",
          "authors": [
              "Antoine Riard"
          ],
          "published_at": "2023-07-20T05:46:25+00:00",
          "summary": "1. Developer Antoine Riard is willing to contribute to the Taproot upgrade by offering his expertise in operational ground, legal information, or financial resources.2. Riard emphasizes the importance of proof-of-work and highlights the need for collaboration in consensus changes within the Bitcoin ecosystem.3. Riard has attracted interest from various organizations interested in supporting his work on softforks and covenants, emphasizing the significance of reliability and a track record in attracting such opportunities.",
          "n_threads": 6,
          "dev_name": "bitcoin-dev",
          "contributors": [
              "Greg Sanders",
              "Keagan McClelland"
          ]
      },
      {
          "id": "021790",
          "title": "On the experiment of the Bitcoin Contracting Primitives WG and marking this community process \"up for grabs\"",
          "link": "https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2023-July/021790.html",
          "authors": [
              "Antoine Riard"
          ],
          "published_at": "2023-07-20T05:33:58+00:00",
          "summary": "- Covenant schemes, such as CTV, have the potential to improve payment pools, channel factories, and self-custody solutions, increasing the odds of Bitcoin's success in terms of onboarding, transactional scaling, and non-first-party to self-sovereign custody solutions.- While a well-functioning Lightning Network is crucial for Bitcoin's survival, covenant schemes like CTV can greatly simplify the complexity of current lightning proposals and contribute to the network's maturity.- There is a need for a dedicated group to evaluate and preserve consensus change proposals for Bitcoin, ensuring thorough testing with a focus on decentralization and FOSS neutrality.",
          "n_threads": 6,
          "dev_name": "bitcoin-dev",
          "contributors": [
              "Greg Sanders",
              "Keagan McClelland"
          ]
      },
      {
          "id": "004014",
          "title": "LN Summit 2023 Notes",
          "link": "https://lists.linuxfoundation.org/pipermail/lightning-dev/2023-July/004014.html",
          "authors": [
              "Carla Kirk-Cohen"
          ],
          "published_at": "2023-07-19T13:56:11+00:00",
          "summary": "- The annual specification meeting took place in NYC in June.- Transcript-style notes were used to reduce reliance on the sender's google drive.- Gratitude is extended to those who traveled long distances, Wolf for hosting, and Michael Levin for assisting with the notes.",
          "n_threads": 1,
          "dev_name": "lightning-dev",
          "contributors": []
      },
      {
          "id": "004013",
          "title": "option_simple_close for \"unfailable\" closing",
          "link": "https://lists.linuxfoundation.org/pipermail/lightning-dev/2023-July/004013.html",
          "authors": [
              "Rusty Russell"
          ],
          "published_at": "2023-07-17T21:55:29+00:00",
          "summary": "1. The pull request introduces a new \"can't fail!\" close protocol that aims to simplify the process and avoid failure scenarios caused by fee disagreement.2. The close protocol provides multiple signatures and options for each side to control their own output, ensuring flexibility and customization in the closing transactions.3. The document also covers other aspects such as normal operation, fees, and features related to closing transactions, providing a comprehensive overview of the new protocol.",
          "n_threads": 1,
          "dev_name": "lightning-dev",
          "contributors": []
      },
      {
          "id": "004012",
          "title": "Potential vulnerability in Lightning backends: BOLT-11 \"payment hash\" does not commit to payment!",
          "link": "https://lists.linuxfoundation.org/pipermail/lightning-dev/2023-July/004012.html",
          "authors": [
              "Martin Habovštiak"
          ],
          "published_at": "2023-07-16T18:11:58+00:00",
          "summary": "- LND does support paying invoices it generates, but it still finds a circular route through the network.- Setting up trusted channels with another node allows for paying invoices without going through the network route and doesn't require external software.- The `\"allow-circular-route\"` flag can be used to double back on the same channel for the route when making payments.",
          "n_threads": 9,
          "dev_name": "lightning-dev",
          "contributors": [
              "Antoine Riard",
              "David A. Harding",
              "Olaoluwa Osuntokun",
              "Rusty Russell",
              "callebtc",
              "fiatjaf"
          ]
      }
  ]
}